Repository: wp-plugins/force-frame
Catalog: languages/force_frame-*.po
Languages: it_it

source: %1$s is not configured: go to the <a href="%2$s">settings page</a> and follow the instructions.
it_it: %1$s non è configurato: vai alla <a href="%2$s">pagina delle impostazioni</a> e segui le istruzioni.

source: Save Changes
it_it: Salva Modifiche

source: Force frame configuration
it_it: Configurazione Force Frame

source: Parent URL
it_it: URL padre

source: Use absolute URL
it_it: Usa URL assoluta

source: Mode
it_it: Modalità

source: GET parameter name
it_it: Nome parametro GET

source: Auto scroll
it_it: Scrolling automatico

source: Auto adjust height
it_it: Aggiusta altezza automaticamente

source: IFrame Attributes
it_it: Attributi IFrame

source: Whitelisted IPs
it_it: IP in Whitelist

source: In order to force this Wordpress site inside an iframe on another site, the following steps are required:
it_it: Per forzare questo sito Wordpress in un iframe all'interno di un altro sito, completa i seguenti passi:

source: Fill the <strong>Parent URL</strong> field below with the URL of the web page where the iframe should be created, for example:
it_it: Inserisci la URL della pagina in cui deve essere creato l'iframe nel campo <strong>URL padre</strong> in basso, per esempio:

source: Add the following snippet inside the HTML of the parent page, in the spot where you want the iframe to be created:
it_it: Aggiungi il seguente pezzo di HTML all'interno della pagina padre, nel punto in cui vuoi che sia creato l'iframe:

source: You're done!
it_it: Finito!

source: Beside showing your site inside an iframe, this plugin does the following:
it_it: Oltre a mostrare il tuo sito in un iframe, questo plugin fa le seguenti cose:

source: when the iframe is loaded, and each time the user navigates to a different url in your site inside the iframe, force-frame communicates the URL of your site to the parent site using %1$s;
it_it: quando l'iframe viene caricato, e ogni volta che l'utente naviga verso una url diversa del tuo sito nell'iframe, force-frame comunica l'URL del tuo sito al sito padre usando %1$s;

source: the parent site then copies that URL inside the fragment or a GET parameter of its URL;
it_it: il sito padre dunque copia quella URL all'interno del fragment o in un parametro GET della sua URL;

source: this way, if the user shares the parent site's URL with someone else, it will contain a reference to the correct URL of your site;
it_it: in questo modo, se l'utente condivide la URL del sito padre con qualcun'altro, questa conterrà un riferimento alla URL corretta del tuo sito;

source: force-frame will use that reference in order to load the correct page of your site inside the iframe.
it_it: force-frame userà quel riferimento per caricare la pagina corretta del tuo sito dentro l'iframe.

source: Additional options are available: see each setting's description for further details.
it_it: Sono disponibili anche altre opzioni: guarda la descrizione di ogni impostazione per ulteriori dettagli.

source: Invalid mode
it_it: Modalità non valida

source: Whitelisted IPs are not in the right format
it_it: Gli IP in Whitelist non sono nel formato corretto

source: If you're using GET mode, here you can customize the GET parameter name used by force-frame.
it_it: Se stai usando la modalità GET, qui puoi personalizzare il nome del parametro GET usato da force-frame.

source: By default, force-frame will just propagate the path part of your site's URL to the parent; if you want the absolute URL to be propagated, enable this option.
it_it: Per default, force-frame propagherà soltanto la parte path della URL del tuo sito al sito padre; se preferisci che sia propagata la URL assoluta, attiva questa opzione.

source: By default, force-frame will use the fragment part of the parent's URL to propagate the URL of your site; however, if the parent site must use its fragment for other purposes, force-frame can use a configurable GET parameter instead. Fragment mode is generally preferred because the parent doesn't reload each time the user navigates to a different URL in the iframe, while it does in GET mode.
it_it: Per default, force-frame userà la parte fragment della URL del padre per propagare la URL del tuo sito; tuttavia, se il sito padre deve usare il fragment per altri scopi, force-frame può usare al posto del fragment un parametro GET configurabile. La modalità Fragment è generalmente la preferita perchè il sito padre non si deve ricaricare ogni volta che l'utente naviga verso una URL diversa nell'iframe, mentre in modalità GET questo è necessario.

source: If enabled, force-frame will scroll the browser's window to the top of the iframe each time the user navigates to a different url in the iframe (only if the top is not already visible).
it_it: Se si attiva questa opzione, force-frame effettuerà automaticamente lo scroll della finestra del browser fino alla cima dell'iframe ogni volta che l'utente naviga verso una URL diversa nell'iframe (solo se la cima non è già visibile).

source: If enabled, force-frame will compute and adjust the iframe height based on its contents whene it is first loaded and when the user navigates to a different url inside it. If you have specified the height attribute below, that value will be overridden by the computed value.
it_it: Se si attiva questa opzione, force-frame calcolerà e aggiusterà l'altezza dell'iframe basandosi sul suo contenuto quando questo viene caricato la prima volta e ogni volta che l'utente naviga verso una nuova URL al suo interno. Se hai specificato l'attributo height più in basso, quel valore sarà sovrascritto dal valore calcolato.

source: Insert here a list of attributes that will be added to the iframe. Add the attributes one per line, using the format <strong>attribute_name</strong>=<strong>attribute_value</strong>. For example:
it_it: Inserisci qui una lista di tutti gli attributi che desideri siano aggiunti all'iframe. Aggiungi gli attributi uno per riga, usando il formato <strong>nome_attributo</strong>=<strong>valore_attributo</strong>. Per esempio:

source: Insert here a list of client IPs for which the site will not be forced inside the iframe, one per line, for example:
it_it: Inserisci qui una lista di IP dei client per i quali il sito non sarà forzato dentro l'iframe, uno per riga, per esempio:

source: A plugin that forces the Wordpress site as an iframe into a configurable parent site, with cross-domain support
it_it: Un plugin che forza il sito Wordpress dentro un iframe in un sito padre configurabile, con supporto per il cross-domain
